In [1]:
import pandas as pd
import numpy as np
import datetime as dt
from datetime import timedelta

In [7]:
Weather=pd.DataFrame({'id':[1,2,3,4,5,6,7],'recordDate':['2015-01-01','2015-01-02','2015-01-03','2015-01-04','2016-12-30','2016-12-31','2017-01-01'],'temperature':[10,25,20,30,30,31,32]})
Weather

   id  recordDate  temperature
0   1  2015-01-01           10
1   2  2015-01-02           25
2   3  2015-01-03           20
3   4  2015-01-04           30
4   5  2016-12-30           30
5   6  2016-12-31           31
6   7  2017-01-01           32

In [8]:
#change str into date
Weather['date']=pd.to_datetime(Weather['recordDate'])
Weather

   id  recordDate  temperature       date
0   1  2015-01-01           10 2015-01-01
1   2  2015-01-02           25 2015-01-02
2   3  2015-01-03           20 2015-01-03
3   4  2015-01-04           30 2015-01-04
4   5  2016-12-30           30 2016-12-30
5   6  2016-12-31           31 2016-12-31
6   7  2017-01-01           32 2017-01-01

In [9]:
#remember in sql date cannot only think about +-1 as they are not str
for i in range(len(Weather['id'])):
    for j in range(len(Weather['id'])):
        if (Weather.loc[j,'date']==Weather.loc[i,'date']+timedelta(days=1)) and (Weather.loc[j,'temperature']>Weather.loc[i,'temperature']):
            print(Weather.loc[j,'id'])

2
4
6
7